lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
    mp_machine_hw_spi_bus_obj_t *self;

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(mp_machine_hw_spi_bus_obj_t);
        self->base.type = &mp_machine_hw_spi_octal_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if (self->buscfg.data0_io_num != data0) reconfigure = true;
        if (self->buscfg.data1_io_num != data1) reconfigure = true;
        if (self->buscfg.data2_io_num != data2) reconfigure = true;
        if (self->buscfg.data3_io_num != data3) reconfigure = true;
        if (self->buscfg.data4_io_num != data4) reconfigure = true;
        if (self->buscfg.data5_io_num != data5) reconfigure = true;
        if (self->buscfg.data6_io_num != data6) reconfigure = true;
        if (self->buscfg.data7_io_num != data7) reconfigure = true;
        if (self->buscfg.sclk_io_num != sck) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

        self->buscfg.data0_io_num = data0;
        self->buscfg.data1_io_num = data1;
        self->buscfg.data2_io_num = data2;
        self->buscfg.data3_io_num = data3;
        self->buscfg.data4_io_num = data4;
        self->buscfg.data5_io_num = data5;
        self->buscfg.data6_io_num = data6;
        self->buscfg.data7_io_num = data7;
        self->buscfg.sclk_io_num = sck;
        self->buscfg.flags = SPICOMMON_BUSFLAG_MASTER | SPICOMMON_BUSFLAG_OCTAL;
        self->buscfg.max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8;
    }

    return MP_OBJ_FROM_PTR(self);



mp_obj_t machine_hw_spi_quad_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_host, ARG_data0, ARG_data1, ARG_data2, ARG_data3, ARG_sck };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_host,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_data0,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_data1,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_data2,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_data3,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_sck,        MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t host = (uint8_t)args[ARG_host].u_int;
    int data0 = (int)args[ARG_data0].u_int;
    int data1 = (int)args[ARG_data1].u_int;
    int data2 = (int)args[ARG_data2].u_int;
    int data3 = (int)args[ARG_data3].u_int;
    int sck = (int)args[ARG_sck].u_int;

    mp_machine_hw_spi_bus_obj_t *self;

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(mp_machine_hw_spi_bus_obj_t);
        self->base.type = &mp_machine_hw_spi_quad_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if (self->buscfg.data0_io_num != data0) reconfigure = true;
        if (self->buscfg.data1_io_num != data1) reconfigure = true;
        if (self->buscfg.data2_io_num != data2) reconfigure = true;
        if (self->buscfg.data3_io_num != data3) reconfigure = true;
        if (self->buscfg.sclk_io_num != sck) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

        self->buscfg.data0_io_num = data0;
        self->buscfg.data1_io_num = data1;
        self->buscfg.data2_io_num = data2;
        self->buscfg.data3_io_num = data3;
        self->buscfg.sclk_io_num = sck;
        self->buscfg.flags = SPICOMMON_BUSFLAG_MASTER | SPICOMMON_BUSFLAG_QUAD;
        self->buscfg.max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8;
    }

    return MP_OBJ_FROM_PTR(self);



mp_obj_t machine_hw_spi_dual_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_host, ARG_data0, ARG_data1, ARG_sck };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_host,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_data0,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_data1,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_sck,        MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t host = (uint8_t)args[ARG_host].u_int;
    int data0 = (int)args[ARG_data0].u_int;
    int data1 = (int)args[ARG_data1].u_int;
    int sck = (int)args[ARG_sck].u_int;

    mp_machine_hw_spi_bus_obj_t *self;

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(mp_machine_hw_spi_bus_obj_t);
        self->base.type = &mp_machine_hw_spi_dual_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if (self->buscfg.data0_io_num != data0) reconfigure = true;
        if (self->buscfg.data1_io_num != data1) reconfigure = true;
        if (self->buscfg.sclk_io_num != sck) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

        self->buscfg.data0_io_num = data0;
        self->buscfg.data1_io_num = data1;
        self->buscfg.sclk_io_num = sck;
        self->buscfg.flags = SPICOMMON_BUSFLAG_MASTER | SPICOMMON_BUSFLAG_DUAL;
        self->buscfg.max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8;
    }

