lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
    return MP_OBJ_FROM_PTR(self);


/******************************************************************************/
// MicroPython bindings for hw_spi

mp_obj_t machine_hw_spi_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_host, ARG_mosi, ARG_miso, ARG_sck };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_host,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_mosi,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_miso,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_sck,        MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t host = (uint8_t)args[ARG_host].u_int;
    int mosi = (int)args[ARG_mosi].u_int;
    int miso = (int)args[ARG_miso].u_int;
    int sck = (int)args[ARG_sck].u_int;

    mp_machine_hw_spi_bus_obj_t *self;

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(mp_machine_hw_spi_bus_obj_t);
        self->base.type = &mp_machine_hw_spi_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if (self->buscfg.miso_io_num != miso) reconfigure = true;
        if (self->buscfg.mosi_io_num != mosi) reconfigure = true;
        if (self->buscfg.sclk_io_num != sck) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

        self->buscfg.miso_io_num = miso;
        self->buscfg.mosi_io_num = mosi;
        self->buscfg.sclk_io_num = sck;
        self->buscfg.flags = SPICOMMON_BUSFLAG_MASTER;
        self->buscfg.max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8;
    }

    return MP_OBJ_FROM_PTR(self);
}


void mp_machine_hw_spi_bus_initilize(mp_machine_hw_spi_bus_obj_t *bus)
{
    if (bus->state != MP_SPI_STATE_STOPPED) return;
    esp_err_t ret;

#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6
    ret = spi_bus_initialize((spi_host_device_t)bus->host, &bus->buscfg, SPI_DMA_CH_AUTO);
#else
    if (bus->host == SPI2_HOST) {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &bus->buscfg, 1);
    } else {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &bus->buscfg, 2);
    }
#endif

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) invalid configuration"), bus->host);
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) sanity check"), bus->host);
            return;
    }

    bus->state = MP_SPI_STATE_STARTED;
}



spi_host_device_t machine_hw_spi_get_host(mp_obj_t in) {
    if (
        (mp_obj_get_type(in) != &mp_machine_hw_spi_bus_type) ||
        (mp_obj_get_type(in) != &mp_machine_hw_spi_dual_bus_type) ||
        (mp_obj_get_type(in) != &mp_machine_hw_spi_quad_bus_type) ||
        (mp_obj_get_type(in) != &mp_machine_hw_spi_octal_bus_type)
    ) {
        mp_raise_ValueError(MP_ERROR_TEXT("expecting a SPI object"));
    }
    mp_machine_hw_spi_bus_obj_t *self = (mp_machine_hw_spi_bus_obj_t *)in;
    return (spi_host_device_t)self->host;
}


mp_obj_t machine_hw_spi_device_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_spi_bus, ARG_freq, ARG_cs, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit, ARG_dual, ARG_quad, ARG_octal };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_spi_bus,  MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ },
        { MP_QSTR_freq,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_cs,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = 0 } },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = 0 } },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = 8 } },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = MICROPY_PY_MACHINE_SPI_MSB} },
        { MP_QSTR_dual,     MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_quad,     MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_octal,    MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_machine_hw_spi_device_obj_t *self = m_new_obj(mp_machine_hw_spi_device_obj_t);
    self->base.type = &mp_machine_hw_spi_device_type;

    int cs =  (int)args[ARG_cs].u_int;

    self->spi_bus = MP_OBJ_TO_PTR(args[ARG_spi_bus].u_obj);
    self->cs = mp_obj_new_int((mp_int_t)cs);
    self->bits =  (uint8_t)args[ARG_bits].u_int;
    self->deinit = &machine_hw_spi_device_deinit_callback;

    bool dual = (bool)args[ARG_dual].u_bool;
    bool quad = (bool)args[ARG_quad].u_bool;
    bool octal = (bool)args[ARG_octal].u_bool;

    if (!(self->spi_bus->buscfg.flags & SPICOMMON_BUSFLAG_DUAL)) dual = false;
    if (!(self->spi_bus->buscfg.flags & SPICOMMON_BUSFLAG_QUAD)) quad = false;
    if (!(self->spi_bus->buscfg.flags & SPICOMMON_BUSFLAG_OCTAL)) octal = false;

    self->dual = dual;
    self->quad = quad;
    self->octal = octal;

    uint8_t flags = 0;

    if (self->firstbit == MICROPY_PY_MACHINE_SPI_LSB) flags |= SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST;

    if (dual || quad || octal) flags |= SPI_DEVICE_HALFDUPLEX;

