lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = (uint32_t)spi_get_actual_clock(APB_CLK_FREQ, args[ARG_freq].u_int, 0),
        .mode = self->phase | (self->polarity << 1),
        .spics_io_num = cs,
        .queue_size = 2,
        .flags = flags,
        .pre_cb = NULL
    };

    spi_device_handle_t spi_device = NULL;

    if (self->spi_bus->state == MP_SPI_STATE_STOPPED) {
        mp_machine_hw_spi_bus_initilize(self->spi_bus);
    }

    esp_err_t ret = spi_bus_add_device((spi_host_device_t)self->spi_bus->host, &devcfg, &spi_device);
    self->user_data = spi_device;

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return mp_const_none;

        case ESP_ERR_NO_MEM:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("out of memory"));
            return mp_const_none;

        case ESP_ERR_NOT_FOUND:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("no free slots"));
            return mp_const_none;
    }

    mp_machine_hw_spi_bus_add_device(self);
    self->active = true;

    return MP_OBJ_FROM_PTR(self);
}


static const mp_machine_spi_p_t machine_hw_spi_device_p = {
    .deinit = machine_hw_spi_device_deinit,
    .transfer = machine_hw_spi_device_transfer,
};


MP_DEFINE_CONST_OBJ_TYPE(
    mp_machine_hw_spi_device_type,
    MP_QSTR_Device,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_device_make_new,
    protocol, &machine_hw_spi_device_p,
    locals_dict, &mp_machine_spi_locals_dict
);


static const mp_rom_map_elem_t machine_spi_bus_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR___del__),       MP_ROM_PTR(&machine_hw_spi_bus_deinit_obj)       }
};


MP_DEFINE_CONST_DICT(machine_spi_bus_locals_dict, machine_spi_bus_locals_dict_table);


MP_DEFINE_CONST_OBJ_TYPE(
    mp_machine_hw_spi_bus_type,
    MP_QSTR_Bus,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_bus_make_new,
    locals_dict, &machine_spi_bus_locals_dict
);

MP_DEFINE_CONST_OBJ_TYPE(
    mp_machine_hw_spi_dual_bus_type,
    MP_QSTR_DualBus,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_dual_bus_make_new,
    locals_dict, &machine_spi_bus_locals_dict
);

MP_DEFINE_CONST_OBJ_TYPE(
    mp_machine_hw_spi_quad_bus_type,
    MP_QSTR_QuadBus,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_quad_bus_make_new,
    locals_dict, &machine_spi_bus_locals_dict
);

MP_DEFINE_CONST_OBJ_TYPE(
    mp_machine_hw_spi_octal_bus_type,
    MP_QSTR_OctalBus,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_octal_bus_make_new,
    locals_dict, &machine_spi_bus_locals_dict
);


static const mp_rom_map_elem_t machine_spi_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR___name__),  MP_OBJ_NEW_QSTR(MP_QSTR_SPI)   },
    { MP_ROM_QSTR(MP_QSTR_Bus),       (mp_obj_t)&mp_machine_hw_spi_bus_type },
    { MP_ROM_QSTR(MP_QSTR_DualBus),   (mp_obj_t)&mp_machine_hw_spi_dual_bus_type },
    { MP_ROM_QSTR(MP_QSTR_QuadBus),   (mp_obj_t)&mp_machine_hw_spi_quad_bus_type },
    { MP_ROM_QSTR(MP_QSTR_OctalBus),  (mp_obj_t)&mp_machine_hw_spi_octal_bus_type },
    { MP_ROM_QSTR(MP_QSTR_Device),    (mp_obj_t)&mp_machine_hw_spi_device_type }
};

MP_DEFINE_CONST_DICT(machine_spi_locals_dict, machine_spi_locals_dict_table);


MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    locals_dict, &machine_spi_locals_dict
);
